In [83]:
import pandas as pd
import numpy as np

In [84]:
headings  = ['Last_name', 'Date_of_birth', 'Gender', 'First_name']

In [85]:
data = pd.read_csv('Deduplication Problem - Sample Dataset.csv', names = headings,skiprows = 1)

In [86]:
data.head()

      Last_name Date_of_birth Gender First_name
0      SMITH JR      01/03/68      F    WILLIAM
1  ROTHMEYER JR      01/03/68      F    WILLIAM
2       ASBY JR      01/03/68      F    WILLIAM
3     SALTER JR      01/03/68      F    WILLIAM
4     SALTER JR      01/03/68      F    WILLIAM

In [87]:
data.loc[0]

Last_name        SMITH JR
Date_of_birth    01/03/68
Gender                  F
First_name        WILLIAM
Name: 0, dtype: object

In [88]:
data.tail()

        Last_name Date_of_birth Gender First_name
98          HANNA      24/11/34      M    ADDISON
99    GALETICH JR      15/10/32      M    ADDISON
100  FUNARO JONES      06/12/37      F    HARRIET
101      FUNARO J      06/12/37      F    HARRIET
102        FUNARO      06/12/37      F    HARRIET

In [89]:
data['Full_name'] = data['First_name'] + ' ' + data['Last_name'] + ' ' + data['Date_of_birth']

In [90]:
data.head()

      Last_name Date_of_birth Gender First_name                      Full_name
0      SMITH JR      01/03/68      F    WILLIAM      WILLIAM SMITH JR 01/03/68
1  ROTHMEYER JR      01/03/68      F    WILLIAM  WILLIAM ROTHMEYER JR 01/03/68
2       ASBY JR      01/03/68      F    WILLIAM       WILLIAM ASBY JR 01/03/68
3     SALTER JR      01/03/68      F    WILLIAM     WILLIAM SALTER JR 01/03/68
4     SALTER JR      01/03/68      F    WILLIAM     WILLIAM SALTER JR 01/03/68

In [91]:
result = {}

In [92]:
for i in range(0, 102):
    a = data.loc[i]
    temp = a[4]
    p = np.array(a[0:4])
    if temp not in result:
        result[temp] = []
        result[temp].append(p)

In [94]:
result

{'ADDISON GALETICH JR 15/10/32': [array(['GALETICH JR', '15/10/32', 'M', 'ADDISON'], dtype=object)],
 'ADDISON HANNA 24/11/34': [array(['HANNA', '24/11/34', 'M', 'ADDISON'], dtype=object)],
 'ADDISON J HANNA 24/11/34': [array(['HANNA', '24/11/34', 'M', 'ADDISON J'], dtype=object)],
 'ADDISON JOHN HANNA 24/11/34': [array(['HANNA', '24/11/34', 'M', 'ADDISON JOHN'], dtype=object)],
 'BILL BLAND JR 21/02/62': [array(['BLAND JR', '21/02/62', 'F', 'BILL'], dtype=object)],
 'BOB MICHAELSON JR 09/04/47': [array(['MICHAELSON JR', '09/04/47', 'M', 'BOB'], dtype=object)],
 'CLARENCE GRIFFIN JR 07/05/37': [array(['GRIFFIN JR', '07/05/37', 'M', 'CLARENCE'], dtype=object)],
 'CLIFFORD GRIFFIN JR 07/05/37': [array(['GRIFFIN JR', '07/05/37', 'M', 'CLIFFORD'], dtype=object)],
 'DARH GRIFFIN JR 07/10/37': [array(['GRIFFIN JR', '07/10/37', 'M', 'DARH'], dtype=object)],
 'DARL GRIFFIN JR 07/05/37': [array(['GRIFFIN JR', '07/05/37', 'M', 'DARL'], dtype=object)],
 'DARL GRIFFIN JR 10/07/37': [array(['GRIFFIN JR', '10/07/37', 'M', 'DARL'], dtype=object)],
 'DONALD CLARK 09/02/45': [array(['CLARK', '09/02/45', 'M', 'DONALD'], dtype=object)],
 'GEORGE FAGEN JR 07/10/37': [array(['FAGEN JR', '07/10/37', 'M', 'GEORGE'], dtype=object)],
 'HAROLD CHAVAS JR 07/10/37': [array(['CHAVAS JR', '07/10/37', 'M', 'HAROLD'], dtype=object)],
 'HAROLD FAGEN JR 07/10/37': [array(['FAGEN JR', '07/10/37', 'M', 'HAROLD'], dtype=object)],
 'HAROLD HOUGHTON JR 07/10/37': [array(['HOUGHTON JR', '07/10/37', 'M', 'HAROLD'], dtype=object)],
 'HAROLD LARSON JR 09/06/39': [array(['LARSON JR', '09/06/39', 'M', 'HAROLD'], dtype=object)],
 'HAROLD MELVIN JR 07/10/37': [array(['MELVIN JR', '07/10/37', 'M', 'HAROLD'], dtype=object)],
 'HAROLD MICHAELSON JR 07/10/37': [array(['MICHAELSON JR', '07/10/37', 'M', 'HAROLD'], dtype=object)],
 'HAROLD MUSTAPHA JR 07/10/37': [array(['MUSTAPHA JR', '07/10/37', 'M', 'HAROLD'], dtype=object)],
 'HAROLD SMITH JR 07/10/37': [array(['SMITH JR', '07/10/37', 'M', 'HAROLD'], dtype=object)],
 'HARRIET FUNARO J 06/12/37': [array(['FUNARO J', '06/12/37', 'F', 'HARRIET'], dtype=object)],
 'HARRIET FUNARO JONES 06/12/37': [array(['FUNARO JONES', '06/12/37', 'F', 'HARRIET'], dtype=object)],
 'JACK MICHAELSON JR 09/06/39': [array(['MICHAELSON JR', '09/06/39', 'M', 'JACK'], dtype=object)],
 'JACK MICHAELSON JR 24/06/39': [array(['MICHAELSON JR', '24/06/39', 'M', 'JACK'], dtype=object)],
 'JAMES MICHAELSON JR 24/06/39': [array(['MICHAELSON JR', '24/06/39', 'M', 'JAMES'], dtype=object)],
 'JOHN CAIN JR 20/01/46': [array(['CAIN JR', '20/01/46', 'M', 'JOHN'], dtype=object)],
 'JOHN CLARK 09/06/45': [array(['CLARK', '09/06/45', 'M', 'JOHN'], dtype=object)],
 'JOHN CLARK 16/12/44': [array(['CLARK', '16/12/44', 'M', 'JOHN'], dtype=object)],
 'JOHN CLARK JR 16/12/44': [array(['CLARK JR', '16/12/44', 'M', 'JOHN'], dtype=object)],
 'JOHN LIND JR 20/01/46': [array(['LIND JR', '20/01/46', 'M', 'JOHN'], dtype=object)],
 'JOHN MICHAELSON JR 16/12/44': [array(['MICHAELSON JR', '16/12/44', 'M', 'JOHN'], dtype=object)],
 'JOHN MICHAELSON JR 24/04/40': [array(['MICHAELSON JR', '24/04/40', 'M', 'JOHN'], dtype=object)],
 'JOHN MICHAELSON JR 24/06/39': [array(['MICHAELSON JR', '24/06/39', 'M', 'JOHN'], dtype=object)],
 'KENNETH LIND JR 31/01/46': [array(['LIND JR', '31/01/46', 'M', 'KENNETH'], dtype=object)],
 'LAWRENCE HOUGHTON JR 31/01/46': [array(['HOUGHTON JR', '31/01/46', 'M', 'LAWRENCE'], dtype=object)],
 'LAWRENCE LIND JR 31/01/46': [array(['LIND JR', '31/01/46', 'M', 'LAWRENCE'], dtype=object)],
 'OWAN MUSTAPHA JR 11/03/47': [array(['MUSTAPHA JR', '11/03/47', 'M', 'OWAN'], dtype=object)],
 'OWEN MUSTAPHA JR 11/03/47': [array(['MUSTAPHA JR', '11/03/47', 'M', 'OWEN'], dtype=object)],
 'ROBERT MICHAELSON JR 09/04/47': [array(['MICHAELSON JR', '09/04/47', 'M', 'ROBERT'], dtype=object)],
 'RON CARLSON JR 25/10/53': [array(['CARLSON JR', '25/10/53', 'F', 'RON'], dtype=object)],
 'RONALD CLARK 09/02/45': [array(['CLARK', '09/02/45', 'M', 'RONALD'], dtype=object)],
 'ROY CARLSON JR 25/10/53': [array(['CARLSON JR', '25/10/53', 'F', 'ROY'], dtype=object)],
 'ROY DUNCAN JR 25/10/53': [array(['DUNCAN JR', '25/10/53', 'F', 'ROY'], dtype=object)],
 'ROY MICHAELSON 25/10/53': [array(['MICHAELSON', '25/10/53', 'M', 'ROY'], dtype=object)],
 'ROY MICHAELSON JR 01/05/51': [array(['MICHAELSON JR', '01/05/51', 'M', 'ROY'], dtype=object)],
 'ROY MICHAELSON JR 09/04/47': [array(['MICHAELSON JR', '09/04/47', 'M', 'ROY'], dtype=object)],
 'ROY MICHAELSON JR 17/06/48': [array(['MICHAELSON JR', '17/06/48', 'M', 'ROY'], dtype=object)],
 'ROY MICHAELSON JR 25/10/53': [array(['MICHAELSON JR', '25/10/53', 'M', 'ROY'], dtype=object)],
 'THOMAS DUNCAN JR 25/10/53': [array(['DUNCAN JR', '25/10/53', 'F', 'THOMAS'], dtype=object)],
 'WILLIAM ASBY JR 01/03/68': [array(['ASBY JR', '01/03/68', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM BLAND 21/02/62': [array(['BLAND', '21/02/62', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM BLAND III 21/02/62': [array(['BLAND III', '21/02/62', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM BLAND JR 08/06/54': [array(['BLAND JR', '08/06/54', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM BLAND JR 21/02/62': [array(['BLAND JR', '21/02/62', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM BLAND JR 25/10/53': [array(['BLAND JR', '25/10/53', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM ROTHMEYER JR 01/03/68': [array(['ROTHMEYER JR', '01/03/68', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM SALTER JR 01/03/68': [array(['SALTER JR', '01/03/68', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM SHAFFER JR 21/02/62': [array(['SHAFFER JR', '21/02/62', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM SHAFFER JR 25/10/53': [array(['SHAFFER JR', '25/10/53', 'F', 'WILLIAM'], dtype=object)],
 'WILLIAM SMITH JR 01/03/68': [array(['SMITH JR', '01/03/68', 'F', 'WILLIAM'], dtype=object)]}

In [95]:
clean = pd.DataFrame(result).transpose()

In [96]:
clean.head()

                                                                0
ADDISON GALETICH JR 15/10/32  [GALETICH JR, 15/10/32, M, ADDISON]
ADDISON HANNA 24/11/34              [HANNA, 24/11/34, M, ADDISON]
ADDISON J HANNA 24/11/34          [HANNA, 24/11/34, M, ADDISON J]
ADDISON JOHN HANNA 24/11/34    [HANNA, 24/11/34, M, ADDISON JOHN]
BILL BLAND JR 21/02/62              [BLAND JR, 21/02/62, F, BILL]

In [97]:
j = 0

for k in headings:
    clean[k] = [clean.iloc[i,0][j] for i in range(0,61)]
    j += 1
    
    
del clean[0]
clean.index = range(61)

In [98]:
clean.head()

     Last_name Date_of_birth Gender    First_name
0  GALETICH JR      15/10/32      M       ADDISON
1        HANNA      24/11/34      M       ADDISON
2        HANNA      24/11/34      M     ADDISON J
3        HANNA      24/11/34      M  ADDISON JOHN
4     BLAND JR      21/02/62      F          BILL

In [99]:
clean.tail()

       Last_name Date_of_birth Gender First_name
56  ROTHMEYER JR      01/03/68      F    WILLIAM
57     SALTER JR      01/03/68      F    WILLIAM
58    SHAFFER JR      21/02/62      F    WILLIAM
59    SHAFFER JR      25/10/53      F    WILLIAM
60      SMITH JR      01/03/68      F    WILLIAM